Tekla Open API Reference for Tekla Structures 2025
EdgeChamfer Properties
The EdgeChamfer type exposes the following members.
Properties
Name | Description
Chamfer
 The chamfer values for the EdgeChamfer.
Father
 The father object of the boolean operation; the model object instance to operate on.
 (Inherited from Boolean.)
FirstBevelDimension
 The bevel dimension if the first end is bevelled.
FirstChamferEndType
 The ChamferEndTypeEnum of the first end.
FirstEnd
 The start point of the EdgeChamfer.
Identifier
 The identifier of the object.
 (Inherited from Object.)
IsUpToDate
Gets if the object does not have a modification which is not shared.
 (Inherited from ModelObject.)
ModificationTime
Gets latest time of the object was modified or created.
 (Inherited from ModelObject.)
Name
 The name of the EdgeChamfer instance.
SecondBevelDimension
 The bevel dimension if the second end is bevelled.
SecondChamferEndType
 The ChamferEndTypeEnum of the second end.
SecondEnd
 The end point of the EdgeChamfer.
Top
See Also
Reference
EdgeChamfer Class
Tekla.Structures.Model Namespace